piotr-wiszowaty/mecrisp-stellaris/include/stm32g0x1.inc
	.equ USART1_BASE, 0x40013800
	.equ USART1_CR1,  USART1_BASE + 0x00
	.equ USART1_CR2,  USART1_BASE + 0x04
	.equ USART1_CR3,  USART1_BASE + 0x08
	.equ USART1_BRR,  USART1_BASE + 0x0C
	.equ USART1_GTPR, USART1_BASE + 0x10
	.equ USART1_RTOR, USART1_BASE + 0x14
	.equ USART1_RQR,  USART1_BASE + 0x18
	.equ USART1_ISR,  USART1_BASE + 0x1C
	.equ USART1_ICR,  USART1_BASE + 0x20
	.equ USART1_RDR,  USART1_BASE + 0x24
	.equ USART1_TDR,  USART1_BASE + 0x28

	.equ USART2_BASE, 0x40004400
	.equ USART2_CR1,  USART2_BASE + 0x00
	.equ USART2_CR2,  USART2_BASE + 0x04
	.equ USART2_CR3,  USART2_BASE + 0x08
	.equ USART2_BRR,  USART2_BASE + 0x0C
	.equ USART2_GTPR, USART2_BASE + 0x10
	.equ USART2_RTOR, USART2_BASE + 0x14
	.equ USART2_RQR,  USART2_BASE + 0x18
	.equ USART2_ISR,  USART2_BASE + 0x1C
	.equ USART2_ICR,  USART2_BASE + 0x20
	.equ USART2_RDR,  USART2_BASE + 0x24
	.equ USART2_TDR,  USART2_BASE + 0x28

	.equ USART_CR1_UE,      BIT0
	.equ USART_CR1_RE,      BIT2
	.equ USART_CR1_TE,      BIT3
	.equ USART_CR1_RXFNEIE, BIT5
	.equ USART_CR1_FIFOEN,  BIT29

	.equ USART_ISR_RXNE, BIT5
	.equ USART_ISR_TC,   BIT6
	.equ USART_ISR_TXE,  BIT7

	.equ USART_CR3_RTSE, BIT8
	.equ USART_CR3_CTSE, BIT9
	.equ USART_CR3_OVRDIS, BIT12

	.equ RCC_BASE,    0x40021000
	.equ RCC_PLLCR,   RCC_BASE + 0x00
	.equ RCC_CFGR,    RCC_BASE + 0x08
	.equ RCC_PLLCFGR, RCC_BASE + 0x0C
	.equ RCC_IOPENR,  RCC_BASE + 0x34
	.equ RCC_APBENR1, RCC_BASE + 0x3C
	.equ RCC_APBENR2, RCC_BASE + 0x40

	.equ RCC_IOPENR_GPIOAEN, BIT0
	.equ RCC_IOPENR_GPIOBEN, BIT1
	.equ RCC_IOPENR_GPIOCEN, BIT2
	.equ RCC_IOPENR_GPIODEN, BIT3
	.equ RCC_IOPENR_GPIOFEN, BIT5

	.equ RCC_APBENR1_USART2EN, BIT17

	.equ RCC_APBENR2_USART1EN, BIT14

	.equ FLASH_BASE, 0x40022000
	.equ FLASH_ACR, FLASH_BASE + 0x00

	.equ GPIOA_BASE,    0x50000000
	.equ GPIOA_MODER,   GPIOA_BASE + 0x00
	.equ GPIOA_OTYPER,  GPIOA_BASE + 0x04
	.equ GPIOA_OSPEEDR, GPIOA_BASE + 0x08
	.equ GPIOA_PUPDR,   GPIOA_BASE + 0x0C
	.equ GPIOA_IDR,     GPIOA_BASE + 0x10
	.equ GPIOA_ODR,     GPIOA_BASE + 0x14
	.equ GPIOA_BSRR,    GPIOA_BASE + 0x18
	.equ GPIOA_LCKR,    GPIOA_BASE + 0x1C
	.equ GPIOA_AFRL,    GPIOA_BASE + 0x20
	.equ GPIOA_AFRH,    GPIOA_BASE + 0x24
	.equ GPIOA_BRR,     GPIOA_BASE + 0x28

	.equ GPIOB_BASE,    0x50000400
	.equ GPIOB_MODER,   GPIOB_BASE + 0x00
	.equ GPIOB_OTYPER,  GPIOB_BASE + 0x04
	.equ GPIOB_OSPEEDR, GPIOB_BASE + 0x08
	.equ GPIOB_PUPDR,   GPIOB_BASE + 0x0C
	.equ GPIOB_IDR,     GPIOB_BASE + 0x10
	.equ GPIOB_ODR,     GPIOB_BASE + 0x14
	.equ GPIOB_BSRR,    GPIOB_BASE + 0x18
	.equ GPIOB_LCKR,    GPIOB_BASE + 0x1C
	.equ GPIOB_AFRL,    GPIOB_BASE + 0x20
	.equ GPIOB_AFRH,    GPIOB_BASE + 0x24
	.equ GPIOB_BRR,     GPIOB_BASE + 0x28

	.equ GPIOC_BASE,    0x50000800
	.equ GPIOC_MODER,   GPIOC_BASE + 0x00
	.equ GPIOC_OTYPER,  GPIOC_BASE + 0x04
	.equ GPIOC_OSPEEDR, GPIOC_BASE + 0x08
	.equ GPIOC_PUPDR,   GPIOC_BASE + 0x0C
	.equ GPIOC_IDR,     GPIOC_BASE + 0x10
	.equ GPIOC_ODR,     GPIOC_BASE + 0x14
	.equ GPIOC_BSRR,    GPIOC_BASE + 0x18
	.equ GPIOC_LCKR,    GPIOC_BASE + 0x1C
	.equ GPIOC_AFRL,    GPIOC_BASE + 0x20
	.equ GPIOC_AFRH,    GPIOC_BASE + 0x24
	.equ GPIOC_BRR,     GPIOC_BASE + 0x28

	.equ GPIOD_BASE,    0x50000C00
	.equ GPIOD_MODER,   GPIOD_BASE + 0x00
	.equ GPIOD_OTYPER,  GPIOD_BASE + 0x04
	.equ GPIOD_OSPEEDR, GPIOD_BASE + 0x08
	.equ GPIOD_PUPDR,   GPIOD_BASE + 0x0C
	.equ GPIOD_IDR,     GPIOD_BASE + 0x10
	.equ GPIOD_ODR,     GPIOD_BASE + 0x14
	.equ GPIOD_BSRR,    GPIOD_BASE + 0x18
	.equ GPIOD_LCKR,    GPIOD_BASE + 0x1C
	.equ GPIOD_AFRL,    GPIOD_BASE + 0x20
	.equ GPIOD_AFRH,    GPIOD_BASE + 0x24
	.equ GPIOD_BRR,     GPIOD_BASE + 0x28

	.equ GPIOF_BASE,    0x50001400
	.equ GPIOF_MODER,   GPIOF_BASE + 0x00
	.equ GPIOF_OTYPER,  GPIOF_BASE + 0x04
	.equ GPIOF_OSPEEDR, GPIOF_BASE + 0x08
	.equ GPIOF_PUPDR,   GPIOF_BASE + 0x0C
	.equ GPIOF_IDR,     GPIOF_BASE + 0x10
	.equ GPIOF_ODR,     GPIOF_BASE + 0x14
	.equ GPIOF_BSRR,    GPIOF_BASE + 0x18
	.equ GPIOF_LCKR,    GPIOF_BASE + 0x1C
	.equ GPIOF_AFRL,    GPIOF_BASE + 0x20
	.equ GPIOF_AFRH,    GPIOF_BASE + 0x24
	.equ GPIOF_BRR,     GPIOF_BASE + 0x28

	.equ NVIC_ISER, 0xE000E100
	.equ NVIC_ICER, 0xE000E180
	.equ NVIC_ISPR, 0xE000E200
	.equ NVIC_ICPR, 0xE000E280
	.equ NVIC_IPR0, 0xE000E400
	.equ NVIC_IPR1, 0xE000E404
	.equ NVIC_IPR2, 0xE000E408
	.equ NVIC_IPR3, 0xE000E40C
	.equ NVIC_IPR4, 0xE000E410
	.equ NVIC_IPR5, 0xE000E414
	.equ NVIC_IPR6, 0xE000E418
	.equ NVIC_IPR7, 0xE000E41C
